#include "Test.h"
/*********************************************************************************************
1、分别使用引用和宏完成交换方法（使用内联），体会两者异同
2、按照指定的函数声明，完成函数：
a、将一个字符串转换为数字，返回值用来校验转换是否成功
bool strtoi(const char *, int &);
b、将一个数字通过指定进制按位逆序（直接覆盖原数）
void sysReverse(int &, int);
********************************************************************************************/


int main()
{
	int i = 10;
	int j = 20;

	int& a = i;
	int& b = j;

	MySwap1(a, b);
	cout << a << endl;

	MySwap2(a, b);
	cout << a << endl;

	char z[3] = "a";
	int z1 = (int)z;
	cout << z1 << endl;
	return 0;
}