#include "Sort.h"
/***************************************************************************************************
1、写一个排序函数接口，能完成对整数和小数的排序。
2、接口中多传入一个缺省参数，如果不指定，就采用A排序方式，如果指定了，就按他的选择决定排序方式（至少包含三种）。
3、在上述的基础上，完成对结构体的排序。通过传入判断大小的函数来实现。
**************************************************************************************************/

int main()
{
	int size = 0;
	double arr[] = { 2, 1, 4, 3, 6, 5, 8, 7, 0, 9 ,1.3,1.2};
	size = sizeof(arr) / sizeof(arr[0]);
	
	MySort(arr,size,0);
		
	system("pause");
	return 0;
}


